Revit 2027 API
BuiltInFailures.AutoRouteFailures.NotAllPartsWereConvertedPlaceholdersWereAddedWarning Property
 Not all parts were converted. Placeholders were added to fill the gaps. Check the fabrication service definition for the system.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NotAllPartsWereConvertedPlaceholdersWereAddedWarning { get; }
Public Shared ReadOnly Property NotAllPartsWereConvertedPlaceholdersWereAddedWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NotAllPartsWereConvertedPlaceholdersWereAddedWarning {
	FailureDefinitionId^ get ();
}
static member NotAllPartsWereConvertedPlaceholdersWereAddedWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AutoRouteFailures Class
Autodesk.Revit.DB Namespace